#include <iostream>
#include <string>
// #include <optional>
#include <algorithm>
#include <vector>
#include <sstream>
#include <iomanip>
// #include <json/json.h>
#include <fstream>

#include <session.h>
#include <functions.h>

#include <exception>


using namespace std;

// TO DO LIST:
// error handling


// Составить список учебной группы. Для каждого студента указать имя, фамилию,
// отчество, курс, оценки по четырем предметам.
// Запрос: вычислить средний балл любого курса.

// ОКТЯБРЬ

// 1. Организовать меню с обозначенным набором задач. +
// 2. Осуществить ввод информации с клавиатуры. +
// 3. Осуществить вывод данных на экран (распечатка в виде таблицы). +
// 4. Обеспечить распечатку данных по запросу +


// Задание на ноябрь (30% от всего объёма работы):

// Выполнить следующие пункты меню:
// 1. Добавление записи. +
// 2. Изменение записи. +
// 3. Удаление записи. + 
// 4. Сортировку массива. +


// Задание на декабрь (40% от всего объёма работы):
// Выполнить следующие пункты меню:
// 1. Загрузка базы данных из текстового файла.
// 2. Загрузка базы данных из бинарного файла.
// 3. Выгрузка базы данных в текстовый файл.
// 4. Перевод содержимого текстового файла в бинарный.
// 5. Отладить полностью приложение со всеми представленными функциями
// (пунктами меню).
// 6. Сделать отчёт по практике и подготовиться к защите.


// Для билда
// g++ -Iinclude include/*.h src/*.cpp main.cpp -o main
int main() {
    loadUserCreds();
    const int a = LoginCycle();
    return 0;
};